---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsPath.StairsId
source: html/63edfbf5-ef20-7a6a-5fea-208ce5cf4e20.htm
---
# Autodesk.Revit.DB.Architecture.StairsPath.StairsId Property

The host stairs element id.

## Syntax (C#)
```csharp
public LinkElementId StairsId { get; }
```